"""
Имя датасета titanic
Очистите датасет по титанику удалив ненужные столбцы.
в столбце возраста замените пропущенные значения средним значением возраста пассажиров.
Проилюстрируйте на графике количество пассажиров по возрастам.
Выведите график количества пассажиров по классу каюты.
Выведите график зависимости стоимости билета от класса каюты.
Выведите график отношения возраста и класса каюты.
Покажите на графике сколько выжило мужчин и сколько выжило женщин,
объедените его с графиком сколько мужчин и женщин не выжили.
Выведите круговую диаграмму количества пассажиров по классу каюты.
"""